mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;
    float sum_sq = 0.0f;

    while (samples_read < num_mono_samples) {
        size_t frames_to_read = num_mono_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (float)s;
            sum_sq += (float)(s * s);
        }
        samples_read += got_frames;
    }

    if (out_rms) {
        *out_rms = sqrtf(sum_sq / num_mono_samples);
    }

    return true;
}

/* ---------- Read Audio to Int16 Buffer (Stereo -> Mono Left) ---------- */

static bool read_audio_to_buffer(int16_t *out_buffer, size_t num_samples)
{
    const size_t bytes_per_sample = sizeof(int32_t);
    const size_t chunk_frames = 256;
    
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;

    while (samples_read < num_samples) {
        size_t frames_to_read = num_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (int16_t)s;
        }
        samples_read += got_frames;
    }

    return true;
}

/* ============================================================
 * VAD 方法: FFT 頻域能量分析
 * 計算特定頻率範圍內的能量，可過濾非人聲頻率
 * ============================================================ */

/* ============================================================
 * VAD 方法: FFT 頻域能量分析 (優化版)
 * 計算特定頻率範圍內的能量，可過濾非人聲頻率
 * ============================================================ */

// 預計算的旋轉因子查表 (針對 FFT_SIZE 512)
static float twiddle_r[FFT_SIZE / 2];
static float twiddle_i[FFT_SIZE / 2];
static bool twiddle_initialized = false;

static void init_twiddle_factors() {
    if (twiddle_initialized) return;
    for (int i = 0; i < FFT_SIZE / 2; i++) {
        float angle = -2.0f * (float)M_PI * i / FFT_SIZE;
        twiddle_r[i] = cosf(angle);
        twiddle_i[i] = sinf(angle);
    }
    twiddle_initialized = true;
}

/**
 * 優化版 FFT 計算 (基 2 DIT，查表法)
 */
static void vad_fft_compute_optimized(float *real, float *imag, int n)
{
    init_twiddle_factors();
    int j = 0;
    for (int i = 0; i < n - 1; i++) {
        if (i < j) {
            float temp_r = real[i]; float temp_i = imag[i];
            real[i] = real[j]; imag[i] = imag[j];
            real[j] = temp_r; imag[j] = temp_i;
        }
        int k = n / 2;
        while (k <= j) { j -= k; k /= 2; }
        j += k;
    }

    for (int len = 2; len <= n; len <<= 1) {
        int half = len >> 1;
        int step = n / len;
        for (int i = 0; i < n; i += len) {
            for (int k = 0; k < half; k++) {
                int twiddle_idx = k * step;
                float wr = twiddle_r[twiddle_idx];
                float wi = twiddle_i[twiddle_idx];
                
                float tr = wr * real[i + k + half] - wi * imag[i + k + half];
                float ti = wr * imag[i + k + half] + wi * real[i + k + half];
                
                real[i + k + half] = real[i + k] - tr;
                imag[i + k + half] = imag[i + k] - ti;
                real[i + k] += tr;
                imag[i + k] += ti;
            }
        }
    }
}

/**
 * 優化版 VAD 判定 (移除頻繁 sqrtf)
 */
static bool vad_new_fft_detect(const float *buffer, size_t length, float *fft_energy_out)
{
    if (length < FFT_SIZE) {
        if (fft_energy_out) *fft_energy_out = 0;
        return false;
    }
    
    static float real[FFT_SIZE];
    static float imag[FFT_SIZE];
    
    // Windowing & Copy
    for (int i = 0; i < FFT_SIZE; i++) {
        float window = 0.54f - 0.46f * cosf(2.0f * (float)M_PI * i / (FFT_SIZE - 1));
        real[i] = buffer[i] * window;
        imag[i] = 0.0f;
    }
    
    vad_fft_compute_optimized(real, imag, FFT_SIZE);
    
    int start_bin = (FFT_FREQ_MIN * FFT_SIZE) / SAMPLE_RATE;
    int end_bin = (FFT_FREQ_MAX * FFT_SIZE) / SAMPLE_RATE;
    
    float sum_power = 0.0f; 
    int bin_count = 0;
    
    for (int i = start_bin; i < end_bin && i < FFT_SIZE/2; i++) {
        // 使用 Magnitude Squared (Power)，省去迴圈內的 sqrtf
        sum_power += (real[i] * real[i] + imag[i] * imag[i]);
        bin_count++;
    }
    
    // 最終只計算一次平方根
    float band_rms = (bin_count > 0) ? sqrtf(sum_power / bin_count) : 0.0f;
    
    if (fft_energy_out) {
        *fft_energy_out = band_rms;
    }
    
    return (band_rms > FFT_ENERGY_THRESHOLD);
}

/**
 * VAD 偵測接口 (含統計顯示)
 * @param buffer 音訊資料
 * @param length 樣本數量
 * @param rms_val 輸出 RMS 值 (可為 NULL)
 * @param fft_energy 輸出 FFT 能量值 (可為 NULL)
 * @return true = 偵測到語音, false = 安靜
 */
static bool vad_detect(const float *buffer, size_t length, 
                       float *rms_val, float *fft_energy)
{
    // 計算 RMS (僅用於調試顯示與基準比較)
    if (rms_val) {
        float sum_sq = 0.0f;
        for (size_t i = 0; i < length; i++) {
            sum_sq += buffer[i] * buffer[i];
        }
        *rms_val = sqrtf(sum_sq / length);
    }
    
