mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
    // FFT 偵測
    bool fft_result = vad_new_fft_detect(buffer, length, fft_energy);
    
    // 統計數據更新
    static uint32_t frame_count = 0;
    frame_count++;
    
    if (fft_result) vad_stats.fft_triggers++;
    
    // 更新平均值 (滑動平均)
    if (fft_energy) vad_stats.fft_avg = vad_stats.fft_avg * 0.99f + (*fft_energy) * 0.01f;
    if (rms_val) vad_stats.rms_avg = vad_stats.rms_avg * 0.99f + (*rms_val) * 0.01f;
    
#if VAD_FFT_DEBUG
    // 定期打印統計數據
    if (frame_count % PRINT_STATS_INTERVAL == 0) {
        printf("\r\n[========== VAD 統計 (Frame: %lu) ==========]\n", (unsigned long)frame_count);
        printf("  FFT 觸發次數:             %lu\n", (unsigned long)vad_stats.fft_triggers);
        printf("  ML 辨識成功次數:          %lu\n", (unsigned long)vad_stats.ml_triggered);
        printf("  RMS 平均值:               %.2f\n", vad_stats.rms_avg);
        printf("  FFT 能量平均值:           %.2f (閾值: %.0f)\n", vad_stats.fft_avg, FFT_ENERGY_THRESHOLD);
        printf("  [========================================]\n\n");
    }
#endif
    
    return fft_result;
}

/* ---------- Send Audio Stream via WebSocket (Base64 Chunked) ---------- */

static bool send_audio_stream_b64(const int16_t *audio_data, size_t sample_count, float confidence)
{
    if (!ws_client || !ws_connected) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return false;
    }

    // 1. Send audio_start
    char start_json[256];
    snprintf(start_json, sizeof(start_json), 
             "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_start\",\"payload\":{\"total_samples\":%zu,\"confidence\":%.3f,\"transfer_mode\":\"base64\"}}",
             (unsigned long)xTaskGetTickCount(), sample_count, confidence);
    
    if (esp_websocket_client_send_text(ws_client, start_json, strlen(start_json), portMAX_DELAY) < 0) {
        return false;
    }

    // 2. Send chunks
    const size_t CHUNK_SAMPLES = 2048; // 4096 bytes per raw chunk
    size_t samples_sent = 0;
    int chunk_idx = 0;

    // Pre-calculate b64 size for the chunk
    size_t raw_chunk_size = CHUNK_SAMPLES * sizeof(int16_t);
    size_t b64_max_len = 0;
    mbedtls_base64_encode(NULL, 0, &b64_max_len, NULL, raw_chunk_size);
    
    char *b64_buffer = (char *)malloc(b64_max_len + 1);
    char *json_buffer = (char *)malloc(b64_max_len + 512);

    if (!b64_buffer || !json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate streaming buffers");
        if (b64_buffer) free(b64_buffer);
        if (json_buffer) free(json_buffer);
        return false;
    }

    while (samples_sent < sample_count) {
        size_t to_send = sample_count - samples_sent;
        if (to_send > CHUNK_SAMPLES) to_send = CHUNK_SAMPLES;

        size_t b64_out_len = 0;
        mbedtls_base64_encode((unsigned char *)b64_buffer, b64_max_len, &b64_out_len, 
                              (const unsigned char *)(audio_data + samples_sent), 
                              to_send * sizeof(int16_t));
        b64_buffer[b64_out_len] = '\0';

        bool is_last = (samples_sent + to_send >= sample_count);
        int written = snprintf(json_buffer, b64_max_len + 512,
                               "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_chunk\",\"payload\":{\"chunk_index\":%d,\"is_last\":%s,\"data_base64\":\"%s\"}}",
                               (unsigned long)xTaskGetTickCount(), chunk_idx, is_last ? "true" : "false", b64_buffer);

        if (esp_websocket_client_send_text(ws_client, json_buffer, written, portMAX_DELAY) < 0) {
            ESP_LOGE(TAG, "Failed to send chunk %d", chunk_idx);
            break;
        }

        samples_sent += to_send;
        chunk_idx++;
        vTaskDelay(pdMS_TO_TICKS(10)); // Prevent flooding
    }

    free(b64_buffer);
    free(json_buffer);
    
    return (samples_sent >= sample_count);
}

/* ---------- Send Audio Stream via WebSocket (Binary Chunked) ---------- */

static bool send_audio_stream_binary(const int16_t *audio_data, size_t sample_count, float confidence)
{
    if (!ws_client || !ws_connected) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return false;
    }

    // 1. Send audio_start (JSON)
    char start_json[256];
    snprintf(start_json, sizeof(start_json), 
             "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_start\",\"payload\":{\"total_samples\":%zu,\"confidence\":%.3f,\"transfer_mode\":\"binary\"}}",
             (unsigned long)xTaskGetTickCount(), sample_count, confidence);
    
    if (esp_websocket_client_send_text(ws_client, start_json, strlen(start_json), portMAX_DELAY) < 0) {
        return false;
    }

    // 2. Send raw binary data in chunks
    const size_t CHUNK_SAMPLES = 4096; // 8192 bytes per binary frame
    size_t samples_sent = 0;

    while (samples_sent < sample_count) {
        size_t to_send = sample_count - samples_sent;
        if (to_send > CHUNK_SAMPLES) to_send = CHUNK_SAMPLES;

        if (esp_websocket_client_send_bin(ws_client, (const char *)(audio_data + samples_sent), 
                                         to_send * sizeof(int16_t), portMAX_DELAY) < 0) {
            ESP_LOGE(TAG, "Failed to send binary chunk");
            break;
        }

        samples_sent += to_send;
        // Binary transfer is faster, but a small delay helps stability
        vTaskDelay(pdMS_TO_TICKS(5)); 
    }

    return (samples_sent >= sample_count);
}

/* ---------- Edge Impulse Signal Callback ---------- */

static int ei_audio_signal_get_data(size_t offset, size_t length, float *out_ptr)
{
    memcpy(out_ptr, ei_slice_buffer + offset, length * sizeof(float));
    return 0;
}

/* ---------- LED Control ---------- */

static void setup_led(void)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_rom_gpio_pad_select_gpio(LED_PIN);
#elif ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    gpio_pad_select_gpio(LED_PIN);
#endif
    gpio_set_direction(LED_PIN, GPIO_MODE_OUTPUT);
    gpio_set_level(LED_PIN, 0);
}

/* ---------- Inference Task ---------- */

static void inference_task(void *arg)
{
    printf("\r\n=== Edge Impulse Wake Word Detection ===\r\n");
    printf("Project : %s  (ID %d)\r\n", EI_CLASSIFIER_PROJECT_NAME, EI_CLASSIFIER_PROJECT_ID);
    printf("Window  : %d ms, Slices: %d\r\n", 
           (int)(EI_CLASSIFIER_RAW_SAMPLE_COUNT * 1000 / EI_CLASSIFIER_FREQUENCY),
           EI_CLASSIFIER_SLICES_PER_MODEL_WINDOW);
    printf("Threshold: %.2f\r\n", (float)EI_CLASSIFIER_THRESHOLD);
    printf("VAD: FFT Energy Threshold = %.0f\r\n\r\n", FFT_ENERGY_THRESHOLD);

    run_classifier_init();

    printf("Warming up microphone...\r\n");
    for (int i = 0; i < 8; i++) {
        read_audio_slice(ei_slice_buffer, EI_CLASSIFIER_SLICE_SIZE, NULL);
    }
    printf("Started.\r\n");

    ei_impulse_result_t result = {};

    while (1) {
        float current_rms = 0.0f;
        float current_fft_energy = 0.0f;

        if (!read_audio_slice(ei_slice_buffer, EI_CLASSIFIER_SLICE_SIZE, NULL)) {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        // 調用統一 VAD 偵測接口 (FFT 優先)
        bool vad_passed = vad_detect(ei_slice_buffer, EI_CLASSIFIER_SLICE_SIZE, 
                                     &current_rms, &current_fft_energy);

        signal_t signal;
        signal.total_length = EI_CLASSIFIER_SLICE_SIZE;
        signal.get_data     = &ei_audio_signal_get_data;

        EI_IMPULSE_ERROR res = run_classifier_continuous(&signal, &result, false);
        if (res != EI_IMPULSE_OK) {
            printf("ERR: Inference failed (%d)\r\n", res);
            continue;
        }

        bool wake_word_detected = false;
        float detected_confidence = 0.0f;
        
        for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++) {
            if (strcmp(ei_classifier_inferencing_categories[i], "heymiaomiao") == 0) {
                detected_confidence = result.classification[i].value;
                
#if VAD_FFT_DEBUG
                // Debug log: 顯示候選喚醒詞的 VAD 數據
                if (detected_confidence > 0.3) {
                    printf("[DEBUG] Conf: %.3f, RMS: %.2f, FFT: %.2f(>%.0f?), Pass: %s\n", 
                           detected_confidence, 
                           current_rms,
                           current_fft_energy, FFT_ENERGY_THRESHOLD,
                           vad_passed ? "YES" : "NO");
                }
#endif
                
                // 使用 FFT VAD 判定結果 + ML 信心度
                if (detected_confidence >= EI_CLASSIFIER_THRESHOLD && vad_passed) {
                    wake_word_detected = true;
                    vad_stats.ml_triggered++;  // 記錄 ML 成功觸發次數
                }
            }
        }

        if (wake_word_detected) {
            printf("\r\n>>> 🐱 WAKE WORD DETECTED! (Conf: %.3f) 🐱 <<<\r\n\r\n", detected_confidence);
            
            for (int k = 0; k < 3; k++) {
                gpio_set_level(LED_PIN, 1);
                vTaskDelay(pdMS_TO_TICKS(100));
                gpio_set_level(LED_PIN, 0);
                vTaskDelay(pdMS_TO_TICKS(100));
            }
            
            printf(">>> REC: Starting 3-second recording...\r\n");
            
            // Allocate memory dynamically
            recording_buffer = (int16_t *)malloc(AUDIO_BUFFER_SIZE_3S);
            if (recording_buffer == NULL) {
                printf(">>> REC: Failed to allocate memory (OOM)!\r\n");
                continue;
            }

            recording_samples = 0;
            recording_complete = false;
            
            bool success = read_audio_to_buffer(recording_buffer, AUDIO_SAMPLES_3S);
            
            if (success) {
                recording_samples = AUDIO_SAMPLES_3S;
                recording_complete = true;
                printf(">>> REC: Completed. Samples: %zu\r\n", recording_samples);
            } else {
                printf(">>> REC: Failed during I2S read!\r\n");
            }
            
            vTaskDelay(pdMS_TO_TICKS(100));
            
            if (recording_complete && recording_samples > 0) {
                printf(">>> WAV: Sending %zu samples via WebSocket (%s)...\r\n", 
                       recording_samples, USE_BINARY_STREAM ? "Binary" : "Base64 Streaming");
                
                bool sent = false;
                if (USE_BINARY_STREAM) {
                    sent = send_audio_stream_binary(recording_buffer, recording_samples, detected_confidence);
                } else {
                    sent = send_audio_stream_b64(recording_buffer, recording_samples, detected_confidence);
                }
                
                if (sent) {
                    printf(">>> WAV: Sent successfully!\r\n");
                } else {
                    printf(">>> WAV: Send failed!\r\n");
                }
            }
            
            // FREE memory after sending
            free(recording_buffer);
            recording_buffer = NULL;
            
            vTaskDelay(pdMS_TO_TICKS(500));
        }
    }
}

extern "C" int app_main()
{
    // Initialize NVS
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    setup_led();
    init_wifi();
    init_websocket();
    init_i2s();
    
    xTaskCreate(inference_task, "ei_infer", 16384, NULL, 5, NULL);
    return 0;
}
